<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Lecture : <br>ER, Relational, SQL Final Lecture (for now)<br>Examples
</span>
</center></i>

<u><span style="font-size: 24px;">Initialize Environment</span></u>
<br><br>

In [3]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/W4111Examples

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: dbuser@W4111Examples'

# Data and Time

## Let's Create a Person Table

In [19]:
%%sql

drop table if exists Person;

CREATE TABLE `W4111Examples`.`Person` (
  `uni` VARCHAR(16) NOT NULL,
  `auto_id` INT NOT NULL AUTO_INCREMENT,
  `last_name` VARCHAR(64) NOT NULL,
  `first_name` VARCHAR(64) NOT NULL,
  `middle_initial` CHAR(1) NOT NULL,
  `DOB` DATE NOT NULL,
  UNIQUE INDEX `uni_UNIQUE` (`uni` ASC) VISIBLE,
  PRIMARY KEY (`auto_id`),
  INDEX `name_idx` (`last_name` ASC, `first_name` ASC, `middle_initial` ASC) VISIBLE);

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
0 rows affected.
0 rows affected.

[]

__Notes:__
1. ```uni``` and ```auto_id``` are _candidate keys._ I chose ```auto_id``` for the primary key, and we will see why later in the lecture.<br><br>
2. The index on ```last_name, first_name``` may significantly improve performance for SQL operations.
    - The index is an index on both ```last_name``` alone, and ```last_name``` and ```first_name``` together.
    - It is __not__ an index on ```first_name``` alone.
    - Thus, it helps with
        - ```where last_name='Ferguson' ```
        - ```where last_name='Ferguson' and first_name='Donald' ```
    - But does not help with,
        - ```where first_name='Donald' ```
        - ```where last_name='Ferguson' OR first_name='Donald' ```
    - We will understand in the next module.

## Date

- A common problem in databases is that people like "January 1, 2018" and databases like ```TIMESTAMP``` or ```DATE``` types.


- Let's make a test table and add some values.

In [5]:
%%sql

CREATE TABLE `W4111Examples`.`test_date_time` (
  `date_string` VARCHAR(64) NULL,
  `time_string` VARCHAR(64) NULL,
  `date_type` DATE NULL,
  `time_stamp_type` TIMESTAMP NULL);

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
0 rows affected.

[]

In [9]:
%%sql

insert into test_date_time(date_string)
    values
        ('January 1st, 1960'),
        ('April 1st, 2019');

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.
2 rows affected.

[]

- Why is this bad? One example is that it sorts that date as if they were strings, like names.

In [10]:
%sql select * from test_date_time order by date_string asc;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[('April 1st, 2019', None, None, None),
 ('January 1st, 1960', None, None, None)]

- Most languages have functions and libraries to handle string/date and time conversion.

In [13]:
%%sql

select date_string, str_to_date(date_string, "%M %D, %Y") as parsed_string from
    test_date_time;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[('January 1st, 1960', datetime.date(1960, 1, 1)),
 ('April 1st, 2019', datetime.date(2019, 4, 1))]

- You can use in insert, update, etc.

In [14]:
%%sql

update test_date_time
    set date_type = str_to_date(date_string, "%M %D, %Y")

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[]

- And you can examine the information, and display in friendlier formats.

In [18]:
%%sql
    select date_type,
        date_format(date_type, "(%a) %b-%d-%y") as formated_date
    from
        test_date_time;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[(datetime.date(1960, 1, 1), '(Fri) Jan-01-60'),
 (datetime.date(2019, 4, 1), '(Mon) Apr-01-19')]

- Formatting and parsing is based on pattern string.

<hr style="height:2px;">
<img src="./Lecture_7_Relational_ER_SQL_Final_18.jpg">
<hr style="height:2px;">

- Treating the value as a ```DATE``` type enables functions on the domain:
    - Ordering
    - ```BETWEEN```
    - Operators

In [20]:
%%sql
    select
        *,
        dayofweek(date_type) as day_of_week,
        dayofmonth(date_type) as day_of_month,
        dayofyear(date_type) as day_of_year
    from
        test_date_time;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[('January 1st, 1960', None, datetime.date(1960, 1, 1), None, 6, 1, 1),
 ('April 1st, 2019', None, datetime.date(2019, 4, 1), None, 2, 1, 91)]

In [23]:
%%sql
    SELECT DATEDIFF("1960-01-01", "2019-04-01") as days_between

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
1 rows affected.

[(-21640,)]

## Computed (Generated) Field

- You can create a view.

In [24]:
%%sql

create view personv as select
	*,
    timestampdiff(year, dob, now()) as age
    from
    Person;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
0 rows affected.

[]

- We can use the view to automatically produce the person's age.

In [42]:
%sql select * from personv;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
1 rows affected.

[('mm1', 1, 'Mouse', 'Mickey', None, datetime.date(1928, 11, 18), 91)]

- The view is relatively simple, can we insert through the view?

In [44]:
try:
    %sql insert into personv (uni, last_name, first_name,  DOB) values('dd2', "Duck", "Donald", '000-01-01')
    print("Insert worked!")
except Exception as e:
    print("Insert got exception e = ", e)

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
Insert got exception e =  (pymysql.err.InternalError) (1471, 'The target table personv of the INSERT is not insertable-into')
[SQL: insert into personv (uni, last_name, first_name,  DOB) values('dd2', "Duck", "Donald", '000-01-01')]
(Background on this error at: http://sqlalche.me/e/2j85)

- Oh Well. We can insert into the base table.

In [45]:
%sql insert into person (uni, last_name, first_name,  DOB) values('dd2', "Duck", "Donald", '000-01-01')

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
1 rows affected.

[]

- And see through the view.

In [46]:
%sql select * from personv;

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[('mm1', 1, 'Mouse', 'Mickey', None, datetime.date(1928, 11, 18), 91),
 ('dd2', 5, 'Duck', 'Donald', None, '0000-01-01', 2020)]

- Maybe we can update through the view, because the data and age are incorrect.

In [47]:
%%sql

update personv set dob='1934-06-09' where uni='dd2'

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
1 rows affected.

[]

- OK. That worked. What can we see?


- The view.

In [48]:
%sql select * from personv

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[('mm1', 1, 'Mouse', 'Mickey', None, datetime.date(1928, 11, 18), 91),
 ('dd2', 5, 'Duck', 'Donald', None, datetime.date(1934, 6, 9), 85)]

- The base table.

In [49]:
%sql select * from person

 * mysql+pymysql://dbuser:***@localhost/W4111Examples
2 rows affected.

[('mm1', 1, 'Mouse', 'Mickey', None, datetime.date(1928, 11, 18)),
 ('dd2', 5, 'Duck', 'Donald', None, datetime.date(1934, 6, 9))]